package lesson05;
// Задание 22
// Написать программу, выполняющую поиск в строке шестнадцатеричных чисел,
// записаных по правилам Java, с помощью регулярных выражений и вывести их на
// страницу.

public class MetodTask22 {
    public static void main(String[] args) {
//        String str = "1C3B3";
//        String str2 = "9E73C";
//        String str3 = "9E73K";
//        System.out.println(str.matches("[0-9ABCDEF]+\\d"));
//        System.out.println(str2.matches("[0-9A-F]+\\(d| W)"));
//        System.out.println(str3.matches("[0-9A-F]+\\d"));
    }
}
